/*
 Три друга – Петр, Роман и Сергей учатся на математическом, физическом и химическом
 факультетах университета. Если Петр математик, то Сергей не физик. Если Роман не
 физик, то Петр –математик. Если Сергей не математик, то Роман –химик.
 Где учится Роман?
 */

human("Роман").
human("Петр").
human("Сергей").

% Eсли Петр математик, то Сергей не физик
conditionFirst([[X, "Физический"], [Y, "Математический"], [Z, "Химический"]]) :-
	Y = "Петр",
	not(X = "Сергей"), !.
conditionFirst([[X, "Физический"], [Y, "Математический"], [Z, "Химический"]]) :-
	not(Y = "Петр").

% Если  Роман  не  физик,  то  Петр –математик
conditionSecond([[X, "Физический"], [Y, "Математический"], [Z, "Химический"]]) :-
	not(X = "Роман"),
	Y = "Петр", !.
conditionSecond([[X, "Физический"], [Y, "Математический"], [Z, "Химический"]]) :-
	X = "Роман".

% Если Сергей  не математик, то Роман –химик
conditionThird([[X, "Физический"], [Y, "Математический"], [Z, "Химический"]]) :-
	not(Y = "Сергей"),
	Z = "Роман", !.
conditionThird([[X, "Физический"], [Y, "Математический"], [Z, "Химический"]]) :-
	Y = "Сергей".

go:-
    human(X), human(Y), human(Z),
    not(X = Y), not(X = Z), not(Y = Z),
    Data = [[X, "Физический"], [Y, "Математический"], [Z, "Химический"]],
    conditionFirst(Data),
    conditionSecond(Data),
    conditionThird(Data),

    write("Факультеты ребят: "), nl,
    write(X), write(" - "), write("Физический"), nl,
    write(Y), write(" - "), write("Математический"), nl,
    write(Z), write(" - "), write("Химический"), !.
